package com.mairo.bot

import com.mairo.bot.ParentBot._

trait StartCommand {
  def startCmdText(version: String): String = {
    s"""
       |$START_CMD - інфа про можливості бота
       |--------------------------------------
       |$SELF_CMD - Дані про себе
       |--------------------------------------
       |$PLAYERS_CMD - Всі існуючі юзери з id
       |--------------------------------------
       |$LAST_CMD [n] - показати n останніх матчів
       |(n - опціонально, по дефолту 6)
       |--------------------------------------
       |$STATS_CMD [x] - рейтинг гравців у сезоні
       |(x - формат сезона, опціонально)
       |якщо x відсутній, то now()
       |приклад: S1|2019, S4|2020
       |--------------------------------------
       |$ADD_CMD [surname1/surname2 surname3/surname4] - додати гру
       |(тільки для адмінів)
       |--------------------------------------
       |           version:$version
                    """.stripMargin
  }
}
